---
kind: method
id: M:Autodesk.Revit.DB.TableData.IsValidZoomLevel(System.Int32)
source: html/0b29dd56-50f3-1768-513f-545bfa4db09f.htm
---
# Autodesk.Revit.DB.TableData.IsValidZoomLevel Method

Verifies if the value of zoom level is valid.

## Syntax (C#)
```csharp
public bool IsValidZoomLevel(
	int zoomLevel
)
```

## Parameters
- **zoomLevel** (`System.Int32`) - The value of zoom level.

## Returns
True if the value of zoom level is inside of the acceptable range, false otherwise.